{
    "ImgPath": "data/articles/Arcane-Article-Image.jpg",
    "Headline": "Arcane's showrunners would like to shake things up after 9 years, which is part of why it's ending with Season 2",
    "TextContent": "<p>Riot's co-founder also says \"there are lots of other stories to tell\".</p> <p>As Arcane Season 2 wraps up its second act, I find myself in a state of suspended animation—not because it's bad, but because it ended on such a cliffhanger that I'm left all dangling and desperate for a conclusion. It's been a markedly more complex show so far, and it's spinning a lot more plates, but I've been having a blast. I'm also wondering how it's all gonna end, considering the fact that this second season will be its last.</p> <p>It's not been cancelled, or anything. While there was a joke that it was meant to run for five whole seasons, it was only a bit of banter—it's simply going to end because, well, its showrunners have been working on it for nine whole years, and would quite like to do something else, thanks.</p> <p>That's as per an interview with Animation Magazine featuring co-showrunner Christian Linke and co-series director Pascal Charrue, the latter of whom lays it out cleanly: \"We spent nine years at this point on these 11 or so characters, so there’s also something about wanting to make sure that we are able to tell the stories of other characters that we’re also really passionate about.\"Linke concurs, adding: \"There’s people who were single when they started on Arcane and now they’re married and have kids in school.\" That's a heck of a long time to be working on any one project—so I'm not at all shocked that Fortiche, the studio behind the series, wants a change. Even if it was a golden opportunity, as Linke puts it, saying that \"we were also just really lucky that we were able to have a higher budget for an animated series, because we were an IP by Riot. We were able to really put art first. You don’t often get that opportunity.\"</p> <p>As for what the studio wants to make next? That's a bit up in the air. Fortiche works in collaboration with Riot, but it's not beholden to the studio—so it could very well be dipping its toes into other franchises. After all, 'we made Arcane' is a solid gold star on your resume.</p> <p>We do happen to know the studio's making Penelope of Sparta, a feature-length film based on Greek myth, but whether it'll come back to prestige TV for another swing at the League of Legends universe is another thing entirely. There's an inkling from Riot's co-founder on Twitter, who states that Arcane 'only' ran for two seasons because \"there are lots of other stories to tell\".</p> <p>Naturally, neither Linke nor Chaurre are at liberty to give the game away in this interview, but Linke says \"there are things that I certainly have on my bucket list. People will walk to places with this that I won’t be able to control,\" and in doing so, pre-emptively shoots down a joke I was about to make about a Hamilton-style rap retelling of Arcane when he adds: \"but someday I want us to make a musical.\"</p> <p>As for the mark Linke hopes to leave in the industry: \"Hopefully, other studios and IPs will see, 'Hey, bigger budget animation, animated series and expressive animation can be really amazing,’ and there will just be simply more.\" Hear hear.</p>"
}
