{
    "ImgPath": "data/articles/La-La-Land-Article-Image.jpg",
    "Headline": "‘La La Land’ Heads Back To China For Christmas",
    "TextContent": "<p>Lionsgate‘s 6x Oscar winning feature musical La La Land is returning to China via distributor JL Film on Dec. 22.</p> <p>The Damien Chazelle directed, Emma Stone and Ryan Gosling picture starring minted $35M of its $470M global B.O. in China. The movie holds the record for an original live-action movie musical at the box office, and it also had a clean sweep at the Golden Globes with seven nominations and seven wins.</p> <p>Today’s news comes as La La Land in Concert marks its sixth year of touring worldwide and Lionsgate continues to expand the IP with a Broadway musical adaptation in the works from Emmy and Tony Award-winning producer Marc Platt.</p> <p>For Chinese audiences, re-releasing La La Land for its seventh anniversary holds a special significance because seven years symbolizes sticking together for a lifetime.</p> <p>JL Film is a fast-growing foreign film investment company. La La Land continues JL Film’s impressive track record of investing in overseas blockbusters. Earlier this year, the distributor released The Expendables 4 in China.</p> <p>Wendy Reeds, Lionsgate Executive Vice President International Sales, said, “La La Land has so many fans across the world, and that’s especially true of China, where audiences have embraced its timeless love story and song-and-dance magic. We’re thrilled that moviegoers can experience it again on the big screen.”</p> <p>Adds JL Film President Ricky Qi: “As one of the numerous loyal fans of La La Land in China, I am honored and proud to be able to re-release this wonderful film. We look forward to bringing La La Land to a large number of Chinese fans.”</p> <p>China Film Group said, “La La Land is part of the inaugural series of re-released films under China Film CO.LTD’s segmented distribution initiative. La La Land holds a special place in the hearts of Chinese audiences. As we celebrate its seventh anniversary with this re-release, we are optimistic about its box office success in China!”</p> <p>La La Land won Oscars for Best Actress (Stone), director (Chazelle), Cinematography (Linus Sandgren), Original Score (Justin Hurwitz), Production Design (David Wasco, Sandy Reynolds Wasco) and the Original Song “City of Stars” by Hurwitz, Benj Pasek and Justin Paul.</p>"
}