{
    "ImgPath": "data/articles/Wild-Robot-Article-Image.jpg",
    "Headline": "‘The Wild Robot’ Sequel In The Works At DreamWorks With Director Chris Sanders",
    "TextContent": "<p>EXCLUSIVE: After crossing $100M globally last weekend, The Wild Robot filmmaker Chris Sanders confirmed this morning at Deadline Contenders that a sequel to the pic is on the way and currently in development at DreamWorks Animation.</p> <p>“100% yes there are absolutely plans for a second one,” Sanders confirmed this morning at Contenders.</p> <p>Three-time Oscar nominee Sanders—the writer-director of DreamWorks Animation’s How to Train Your Dragon, The Croods, and Disney’s Lilo & Stitch — directed the animated feature from a screenplay he also penned. The film is produced by Jeff Hermann (DreamWorks Animation’s The Boss Baby 2: Family Business; co-producer, Kung Fu Panda franchise).</p> <p>In the pic, which is an adaptation of Peter Brown’s award-winning bestseller of the same name, Oscar-winner Lupita Nyong’o plays a robot called ROZZUM unit 7134 — “Roz” for short — that is shipwrecked on an uninhabited island and must learn to adapt to the harsh surroundings, gradually building relationships with the animals on the island and becoming the adoptive parent of an orphaned gosling. The Wild Robot is the first in the trilogy of books written by Brown. The Wild Robot Escapes is the second book in the franchise.</p> <p>Discussing the inspiration behind her vocal performance in the pic, Nyong’o joked that she took notes from “AI voices like Alexa and Siri.”</p> <p>“Alexa, Siri and you know those voices on TikTok and Instagram that are so positive and nothing’s ever wrong. That sort of can-do attitude,” she said. “That was the starting point for Roz and her journey to self-actualization and evolution of self-expression.”</p> <p>Universal/DreamWorks Animation launched the film earlier this month. The Wild Robot also features the voices of Pedro Pascal, Catherine O’Hara, Stephanie Hsu, and Bill Nighy.</p>"
}